{
    "general_information": {
        "working_job_title": "SAP- IT Project Manager",
        "job_family": "Information Technology",
        "job_family_zone": "Specialist – 49303319",
        "position_number": 306,
        "department_name": "NeBIS",
        "sap_organization_unit_number": "50000332 – Tech. Support Team",
        "employee_name": "TBA",
        "date_of_last_update": "1700012800",
        "last_updated_by": "HR",
        "title_of_supervisor": "Associate Vice President/Director of NeBIS",
        "sap_personnel": "HR",
        "name_of_supervisor": "Edwin Mukusha"
    },
    "position_summary": "This position is a part of Nebraska Business Information System team (NeBIS) team responsible for planning, managing, monitoring, and reporting on NeBIS SAP System project activities. The SAP Project Manager will use proven project management methodologies and practices to monitor scope and ensure timely completion of projects. This position provides leadership to NeBIS staff and stakeholders in project management best practices.",
    "duties_and_responsibilities": [
        {
            "responsibility": "Project Management",
            "time_spent_percentage": 75,
            "essential_function": true,
            "tasks": [
                "Manages multiple SAP projects across all project phases, including initiation, planning, execution, monitoring, control and closure.",
                "Collaboration with cross-functional teams to execute strategic initiatives that positively impacts operational access for the institutional business community and business activities.",
                "Create, manage and track project output and plans, including but not limited to: Project plans, project scope statements/charters, Project schedules and cost estimates, Risk and issue logs, change management requests, Status reports.",
                "Provide ongoing project plan/status reporting for customers and management.",
                "Make recommendations about schedules, prioritization, and resource allocation with input from team members.",
                "Defines requirements, resources and schedule for project implementation to deliver project deliverables and meet project goals and milestones.",
                "Assists in developing Requests for Proposals (RFP) for external services, as needed.",
                "Maintains project documentation."
            ]
        },
        {
            "responsibility": "Staff Development/ Mentoring",
            "time_spent_percentage": 25,
            "essential_function": true,
            "tasks": [
                "Provides training and mentoring for NeBIS staff on project management practices and methodologies.",
                "Committed to support the overall strategic goals of the University of Nebraska, NSCS and NeBIS, and as needed, participate in personal/professional growth to stay abreast of industry trends and changes.",
                "Other duties as assigned."
            ]
        }
    ],
    "supervision": "This position doesn’t supervise other positions but provides functional leadership to project members. This position receives indirect and limited supervision from the AVP/ Director of NeBIS.",
    "qualifications_and_attributes": {
        "required_qualifications": [
            "Bachelor’s Degree",
            "5 years of project management experience to include 3 years of experience coordinating and supporting IT business processes.",
            "PMP (Project Management Professional) Certification",
            "Demonstrated excellent verbal and written communication skills with attention to detail."
        ],
        "preferred_qualifications": [
            "Educational coursework in Business Administration, Project Management, Management Information Systems, or Computer Sciences.",
            "Experience with Agile project management methodologies is desired."
        ],
        "helpful_qualifications": "",
        "minimum_qualifications": "",
        "other_information": [
            "An equivalent combination of education and experience from which comparable knowledge and abilities can be acquired may be considered.",
            "The ideal candidate is an agile, self-starter comfortable with collaboration and oversight of distributed resources and/or project teams; exhibits exceptional verbal, writing, editing and proofreading skills; an energetic, creative problem solver who can work independently; a resilient learner who is able to develop relationships with the university’s stakeholders; a track record of timely completion of projects and the ability to responsibly manage competing priorities; and commitment to the ideals of a major public research university."
        ]
    },
    "zone_definition_factors": [
        {
            "factor": "Nature/Complexity of Work",
            "description": "This position requires an individual who takes initiative, and exercises sound judgment in accomplishing project management activities. Complexity of work is high. Position requires competence to manage multiple projects, at various points in the project lifecycle, with multiple sponsors and diverse technology and goals. The ability to become moderately knowledgeable of technical needs in order to problem-solve, evaluate options, and communicate status to stakeholders is critical."
        },
        {
            "factor": "Problem Solving/Decision-making",
            "description": "This position requires the ability to analyze and use sound judgment in determining the means/methods to perform the work and the degree to which detail and information is needed to adequately plan and manage projects. This position requires the ability to handle multiple tasks, identify and solve project issues, and demonstrate flexibility when unexpected circumstances arise, while meeting the goals and objectives of the project and customer."
        },
        {
            "factor": "Strategic Impact",
            "description": "Actions and decisions in this job have significant impact to the immediate and short-term performance of projects which could also impact their long-term success. The job exerts a considerable impact on project decisions and final results typically impact an entire functional area or a major university activity and has accountability for financial and project targets. Errors effect business operations, services and other individuals which may require special interventions to correct. The overall correctness of problem solving and decisions made may not be apparent for variant periods of time ranging from hours to months depending upon the complexity of the issue."
        },
        {
            "factor": "Know How",
            "description": "Essential skills and experiences include: ability to plan and manage the day-to-day activities of projects and project staff; the ability to independently problem solve and analyze situations and issues exhibiting flexibility when unexpected circumstances arise; outstanding oral and written communication skills including the ability to translate complex issues into information that is concise and understandable; strong interpersonal skills; Superior time management and follow through skills; ability to multi-task and prioritize work to meet project due dates; Respond effectively to controversy and unexpected circumstances; good judgment and strong customer service skills; a professional attitude and demeanor with an understanding of the organization and its processes and protocols, particularly as they pertain to customers."
        },
        {
            "factor": "Technical Know How",
            "description": "Proficiency in using computer hardware and software applications is essential. Proficiency in managing projects according to project management best practices methodologies is essential. Ability to tailor project management, development and support processes to meet the needs of individual projects is critical. This position must be able to adjust to competing projects and set priorities to meet deadlines. Experience with project management information systems/tools for capturing, reporting and tracking project information, schedule, cost, status, etc. is essential. The ability to communicate appropriate information to project stakeholders through proficient knowledge of Microsoft PowerPoint, Word, and Excel, Adobe, and e-mail is required."
        },
        {
            "factor": "Interactions",
            "description": "Interactions are required with team members, departmental peers, campus and State of Nebraska representatives, vendors and other NeBIS customers. Ability to work effectively in a professional manner with sensitivity and diplomacy for people at various levels within an organization (technology staff, business stakeholders, end users, management) and others outside the organization. Must have the ability to work as a member of a team, as well as independently, in a collaborative and diversified team environment. The ability to deliver presentations to customer community and administrators is required periodically."
        },
        {
            "factor": "Leadership",
            "description": "Serves as a role model, a department resource, and a mentor through leading by example and providing coaching and training; demonstrates ability to manage workload, employee relations, and other organizational objectives; is able to identify and work through obstacles that reduce department efficiency or effectiveness; serves as an advocate for the interests and needs of the business unit; fosters an optimal working environment that recognizes all the successful contributors in the department, and uses participatory decision making and encourages others to take initiative and reach their full potential."
        }
    ],
    "physical_activities": {
        "general_physical_requirements": [
            {
                "activity": "sitting",
                "hours": 6,
                "type": "constant"
            },
            {
                "activity": "standing",
                "hours": 1,
                "type": "intermittent"
            },
            {
                "activity": "walking",
                "hours": 1,
                "type": "intermittent"
            },
            {
                "activity": "drive_motor_vehicle",
                "hours": 0,
                "type": ""
            }
        ],
        "specific_physical_requirements": [
            {
                "activity": "squating",
                "frequency": ""
            },
            {
                "activity": "bending",
                "frequency": "occasionally"
            },
            {
                "activity": "kneeling",
                "frequency": "occasionally"
            },
            {
                "activity": "reaching_overhead",
                "frequency": "occasionally"
            },
            {
                "activity": "reaching_forward",
                "frequency": "occasionally"
            },
            {
                "activity": "reaching_low",
                "frequency": "occasionally"
            },
            {
                "activity": "twisting",
                "frequency": ""
            },
            {
                "activity": "crawling",
                "frequency": ""
            },
            {
                "activity": "climbing_ladders",
                "frequency": ""
            },
            {
                "activity": "climbing_stairs",
                "frequency": "occasionally"
            },
            {
                "activity": "climbing_other",
                "frequency": ""
            },
            {
                "activity": "walking_on_rough_ground",
                "frequency": ""
            },
            {
                "activity": "exposure_to_changes_of_temperature_humidity",
                "frequency": ""
            },
            {
                "activity": "exposure_to_dust_fumes_gases_chemicals",
                "frequency": ""
            },
            {
                "activity": "being_near_moving_machinery",
                "frequency": ""
            },
            {
                "activity": "working_from_heights",
                "frequency": ""
            }
        ],
        "lifting_handling_reqs": [
            {
                "activity_type": "lift",
                "weight_range": "11-24 lbs",
                "frequency": "Up to 2 hrs daily"
            },
            {
                "activity_type": "carry",
                "weight_range": "11-24 lbs",
                "frequency": "Up to 2 hrs daily"
            },
            {
                "activity_type": "push",
                "weight_range": "11-24 lbs",
                "frequency": "Up to 2 hrs daily"
            },
            {
                "activity_type": "pull",
                "weight_range": "11-24 lbs",
                "frequency": "Up to 2 hrs daily"
            }
        ],
        "manual_dexterity_requirements": [
            {
                "task": "Keyboarding",
                "hand_usage": {
                    "right_hand": false,
                    "left_hand": false,
                    "both_hands": true
                }
            },
            {
                "task": "filing",
                "hand_usage": {
                    "right_hand": false,
                    "left_hand": false,
                    "both_hands": true
                }
            },
            {
                "other_description": "Operation of a business office equipment"
            }
        ],
        "work_attendance_requirements": {
            "must_attend_workplace": true,
            "alt_worksite_eligible": false,
            "wfo_essential": false,
            "wfo_non_essential": true
        }
    },
    "application_procedure": "",
    "additional_information": "",
    "confidence_scores": {
        "general_information": 0.95,
        "position_summary": 0.95,
        "duties_and_responsibilities": 0.95,
        "supervision": 0.95,
        "qualifications_and_attributes": 0.95,
        "zone_definition_factors": 0.9,
        "physical_activities": {
            "general_physical_requirements": 0.9,
            "special_physical_requirements": 0.85,
            "lifting_handling_requirements": 0.85,
            "manual_dexterity_requirements": 0.85,
            "work_attendance_requirements": 0.95
        },
        "application_procedure": 0.95,
        "additional_information": 0.95
    }
}
